print('<-----------------Baha-------------------->\t')
Anna = {
'Xiaomi_1':   {'Диагональ': '1920-1080', 'ПЗУ': '32', 'ОС': 'Андроид', 'Фирма': 'Xiaomi'}, 
'Xiaomi_2':   {'Диагональ': '1920-1080', 'ПЗУ': '64', 'ОС': 'Андроид', 'Фирма': 'Xiaomi'},
'Xiaomi_3':   {'Диагональ': '1920-1080', 'ПЗУ': '128', 'ОС':'Андроид', 'Фирма': 'Xiaomi'},
'Samsung_1': {'Диагональ': '1920-1080', 'ПЗУ': '32', 'ОС': 'Андроид', 'Фирма': 'Samsung'},
'Samsung_2': {'Диагональ': '1920-1080', 'ПЗУ': '64', 'ОС': 'Андроид', 'Фирма': 'Samsung'},
'Samsung_3': {'Диагональ': '1920-1080', 'ПЗУ': '128', 'ОС':'Андроид', 'Фирма': 'Samsung'},
'IPhone_1':   {'Диагональ': '1920-1080', 'ПЗУ': '32', 'ОС': 'IOS', 'Фирма': 'Apple'},
'IPhone_2':   {'Диагональ': '1920-1080', 'ПЗУ': '64', 'ОС': 'IOS', 'Фирма': 'Apple'},
'IPhone_3':   {'Диагональ': '1920-1080', 'ПЗУ': '128', 'ОС':'IOS', 'Фирма': 'Apple'}}
print (Anna)
s = {}
x = set()
for i in Anna.values():
    for j, k in i.items():
        if not k in x:
            s[j] = 1
            x.add(k)
        else: s[j] += 1
print(s)